import { db } from "./firebaseConfig";
import { collection, addDoc, setDoc, getDocs, doc } from "firebase/firestore";

const addProducts = async () => {
    const products = {
      "آذربایجان شرقی": [
          { "id": 1, "title": "ائل‌گلی", "picture": `https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/El-goli_2.JPG/270px-El-goli_2.JPG`, "description":`ائل‌گلی که با نام پارک شاه‌‌گلی هم شناخته می‌شود، یکی از زیباترین و معروف‌ترین جاهای دیدنی مرکز استان آذربایجان شرقی است. از نظر قدمت و ارزش تاریخی، این مجموعه تفریحی زیبا به دوره آق‌قویونلوها می‌رسد. در ابتدا از این دریاچه برای تأمین آب موردنیاز تبریز استفاده می‌شده و به‌مرور بنای ائل‌گلی زیبا در کنار این دریاچه احداث شده است
          امروزه این مکان گردشگری زیبا شامل هتل‌های لوکس متعدد، مراکز خرید و پارک بازی کودکان است و تمام این امکانات این مجموعه زیبای ائل‌گلی را به یکی از زیباترین جاهای دیدنی آذربایجان شرقی تبدیل کرده است که در سفر به این استان نباید آن را از دست بدهید. قصد دارید از چه طریقی به شمال ایران سفر کنید؟ اگر انتخابتان سفر هوایی است، سریع‌تر برای خرید بلیط هواپیما اقدام کنید.`}
      ],
      "آذربایجان غربی": [
          { "id": 2, "title": "دریاچه ارومیه", "picture": `https://snapp.ir/blog/wp-content/uploads/2023/11/%DB%B1.-%D8%AF%D8%B1%DB%8C%D8%A7%DA%86%D9%87-%D8%A7%D8%B1%D9%88%D9%85%DB%8C%D9%87.jpg`, "description": `آماده‌اید که با بزرگ‌ترین دریاچه آب شور خاورمیانه آشنا شوید؟ این دریاچه معروف در ۱۷کیلومتری مرکز استان آذربایجان غربی، یعنی ارومیه قرار دارد و زیستگاه حیوانات این منطقه است. جزیره‌های زیبای دریاچه محل توقف پرندگان مهاجر است. مجتمع گردشگری باری و دهکده ساحلی چی چست مجتمع‌های ساحلی معروفی‌اند که در نزدیکی ساحل دریاچه واقع شده‌اند و با امکانات متعدد اوقات خوشی برای بازدیدکندگان به ارمغان می‌آورند. برای رزرو بلیط سفر برنامه‌ریزی کرده‌اید؟ اگر تصمیم دارید هوایی به این استان زیبا سفر کنید، هرچه زودتر برای خرید بلیط هواپیما یا بلیط سفر زمینی اقدام کنید.` }
      ],
      "اردبیل": [
          { "id": 3, "title": "بقعه شیخ صفی الدین اردبیلی", "picture": "https://images.kojaro.com/2021/11/9f4ea4db-0285-4c35-959d-f9a59754e9cc.jpg?w=840&h=560", "description": `مجموعه خانقاه و بقعه شیخ صفی‌الدین اردبیلی شاهکاری از هنر و معماری ایرانی محسوب می‌شود که محل دفن شیخ صفی، شاه اسماعیل و تعدادی از صاحب‌منصبان دوره صفوی است. این مجموعه منحصربه‌فرد در سال ۱۳۱۰ در میان آثار ملی ایران قرار گرفت و تنها اثر ثبت جهانی اردبیل به شمار می‌رود که در سال ۲۰۱۰ میلادی (۱۳۸۹ هجری شمسی) در فهرست میراث جهانی یونسکو به ثبت رسید. بناهایی از سال ۷۳۵ تا ۱۰۳۸ هجری قمری (۷۱۴ تا ۱۰۰۸ هجری شمسی) در این مجموعه ساخته شده‌اند که از نظر معماری، تزیینات، صندوق منبت و مشبک‌ قبور و غیره، شکوه معماری مذهبی از دوره ایلخانی تا صفوی را به نمایش می‌گذارند. برای آشنایی بیشتر با این آرامگاه با ما همراه شوید.` }
      ],
      "اصفهان": [
          { "id": 4, "title": " میدان نقش جهان", "picture": "https://www.flytoday.ir/blog/wp-content/uploads/2020/09/Naqsh-e-Jahan5..jpg", "description": `میدان نقش جهان یکی از مهم ترین و منحصر به فرد ترین آثار دیدنی اصفهان است. این میدان یک محیط مستطیل شکل با عرض 160 متر و طول 560 متر است. نقش جهان رتبه دومین میدان بزرگ جهان را دارد. میدان نقش جهان از گذشته تا به امروز نام های متعددی داشته است، در گذشته به میدان شاه مشهور بوده و امروزه نام دیگر آن میدان امام است.
          نقش جهان در گذشته محلی برای برگزاری تمامی جشن ها و بازی چوگان بوده است. قدمت نقش جهان به دوران صفویه بر می گردد و در سال 1313 در فهرست آثار ملی ایران ثبت شد همچنین جزء اولین آثار ایرانی ثبت شده در میراث جهانی یونسکو است. میدان نقش جهان جاذبه بزرگی است که چندین آثار طبیعی دیگر را هم در جود جای داده است، این اثر شامل مجموعه ای از بناهای تاریخی از جمله مسجد جامع عباسی, عمارت عالی قاپور، مسجد شیخ لطف الله و سردر قیصریه است.`}
      ],
      "البرز": [
          { "id": 5, "title": "قلعه آغشت", "picture": "https://images.kojaro.com/2021/3/49d60721-4aa4-4de3-94e6-7bfa21212f9d.jpg?w=840&h=560", "description": `قلعه روستای آغشت یکی از جاهای دیدنی کرج در نزدیکی تهران است که در سال‌های اخیر توجه گردشگران زیادی را به این منطقه جلب کرده است؛ قلعه‌ای عجیب و سحرانگیز که بیننده را به یاد مجموعه فیلم‌های هری پاتر و قلعه هاگوارتز می‌اندازد. روستای آغشت یکی از روستاهای ییلاقی و کوهستانی استان البرز است که با آب و هوایی معتدل، چشمه‌ها و آبشارها، رودخانه و طبیعت بکر و بی‌نظیر مکانی مناسب برای گردش یک روزه در اطراف پایتخت و کرج به شمار می‌آید. 
          قلعه آغشت با نام‌های قلعه برغان، دژ برغان و قلعه هاگوارتز ایران نیز شناخته می‌شود و اگر تاکنون نام آن را نشنیده‌اید، به شما پیشنهاد می‌کنیم که تا پایان این مقاله با ما همراه شوید و به سفری اعجاب‌انگیز در دنیای قرون‌وسطا و رنسانس بیایید.` }
      ],
      "ایلام": [
          { "id": 6, "title": "تنگه کافرین", "picture": "https://images.kojaro.com/2023/5/9682551a-e6c4-468c-ad55-9b20d7cdb258.jpg?w=840&h=560", "description": `تنگه کافرین در استان زیبا و دیدنی ایلام که به عروس زاگرس شهرت دارد، واقع شده است. این استان تنگه‌ها و دره‌های شفگت‌انگیز و تماشایی زیادی دارد که بهترین مکان برای برپایی تورهای هیجان‌انگیز و داشتن سفری ماجراجویانه در دل طبیعت بکر و سرسبز این منطقه از کشورمان هستند. کجارو هم این بار راهی ایلام می‌شود تا گردشی استثنایی در تنگه کافرین بدره داشته باشد.` }
      ],
      "بوشهر": [
          { "id": 7, "title": "گنبد نمکی جاشک", "picture": "https://images.kojaro.com/2021/10/53ec3545-5bef-4496-bb6e-ac210dd594fa.jpg?w=840&h=560", "description": `یکی از شگفت‌انگیزترین پدیده‌های طبیعی استان بوشهر، گنبد نمکی جاشک است. این جاذبه منحصر‌به‌فرد در کوه جاشک، قرار دارد و شامل غارهای نمکی، آبشارهای نمکی، چشمه‌های نمکی، دودکش‌های جن و دیگر سازه‌های طبیعی می‌شود که هرکدام جذابیت خاص خود را دارد. همچنین گنبد نمکی جاشک به‌عنوان بزرگ‌ترین و زیباترین گنبد نمکی ایران به شمار می‌آید و در سطح خاورمیانه نیز شناخته‌شده است. با کجارو همراه شوید و بیشتر درباره گنبد نمکی جاشک بخوانید.` }
      ],
      "تهران": [
          { "id": 8, "title": "مجموعه کاخ سعد آباد", "picture": "https://images.kojaro.com/2023/5/ecca2e44-ec71-4355-ab12-7ae9dac24baa.jpg?w=840&h=560", "description": `مجموعه تاریخی و فرهنگی سعد آباد یکی از برجسته‌ترین مکان‌های تاریخ معاصر ایران است که آخرین پادشاهان ایران در دوره‌های قاجار و پهلوی در آن زندگی می‌کردند. این مجموعه شامل کاخ‌های متعددی می‌شود که از آن جمله می‌توان به کاخ شهوند (کاخ موزه)، کاخ سفید (کاخ موزه)،‌ کاخ اختصاصی سعدآباد (در اختیار نهاد ریاست جمهوری)، کاخ اسود (موزه هنرهای زیبا)، کاخ شمس (موزه پوشاک سلطنتی)، کاخ اشرف (موزه ظروف سلطنتی) و... اشاره کرد. کاخ‌های سعد آباد در میان باغی پر درخت و سرسبز قرار دارند که قدم‌زدن در میان طبیعت زیبای آن خالی از لطف نیست.\\\\` }
      ],
      "چهارمحال و بختیاری": [
          { "id": 9, "title": "قلعه چالشتر", "picture": "https://images.kojaro.com/2022/2/ae450297-21b2-4c10-a4f6-3c007e1f616d.jpg", "description": "شهرکرد به دلیل طبیعت زیبا و کوهستانی به بام ایران معروف است." }
      ],
      "خراسان جنوبی": [
          { "id": 10, "title": "بند دره", "picture": "https://images.kojaro.com/2018/11/c2010474-314c-47da-acf6-daeed9bd6535.jpg?w=840&h=560", "description": `بند دره با قدمتی که به اواخر دوره‌ زندیه و اوایل دوره‌ قاجاریه می‌رسد، از بناهای تاریخی و جاهای دیدنی بیرجند است. این بند چون آب آن از دره بالا و پایین عبور می‌کند، به این اسم مشهور شده است. بند دره که از جمله نقاط گردشگری استان خراسان جنوبی و شهرستان بیرجند محسوب می‌شود، در سال ۱۳۸۱ از سوی سازمان میراث فرهنگی با شماره ۴۸۱۶ در فهرست آثار ملی ایران ثبت گردیده است. این بند که مهم‌ترین بند تاریخی و بزرگ‌ترین بند کوهستانی شهر بیرجند به‌ شمار می‌رود، به دستور امیر شوکت‌الملک در سال ۱۲۹۴ هجری قمری ساخته شده‌ است. ` }
      ],
      "خراسان رضوی": [
          { "id": 11, "title": "خانه داروغه", "picture": "https://images.kojaro.com/2023/5/bf3c70a3-390a-4efe-b2b3-0555fa08b9e5.jpg?w=840&h=560", "description": `در سفر به شهر مشهد، زیارت حرم مطهر امام‌ رضا (ع)، شاندیز و شیشلیک‌های لذیذ آن، طرقبه و سرزمین موج‌های آبی در صدر برنامه سفر گردشگران قرار دارند؛ اما بازدید از خانه‌های قدیمی و تاریخی با معماری‌های زیبا معمولا در برنامه سفر هر گردشگری به چشم نمی‌خورد. بناها و خانه‌های تاریخی، نشان از اصالت و هویت هر شهری دارند و قدمت، فرهنگ و تمدن آن سرزمین را به نمایش می‌گذارند. برخی از این بناهای تاریخی و قدیمی در طول زمان آسیب دیده‌ و تخریب شده‌اند؛ اما بسیاری از آن‌ها توسط سازمان میراث فرهنگی یا سازمان‌های دیگر مرمت شده‌ و اصالت خود را حفظ کرده‌اند. 
          در شهر مشهد نیز خانه‌های قدیمی مرمت شده زیادی وجود دارند که گذشته این شهر را به تصویر می‌کشند. خانه تاریخی داروغه مشهد یکی از جاهای دیدنی مشهد به شمار می‌رود که با معماری زیبا و عجیب خود، چشم‌انتظار گردشگران است. با ما همراه باشید تا شما را با خانه داروغه مشهد، تاریخچه و امکانات آن آشنا کنیم.` }
      ],
      "خراسان شمالی": [
          { "id": 12, "title": "گردشگاه بابا امان", "picture": `https://images.kojaro.com/2023/11/44946d4c-7be4-4189-a597-a87d643b7b2d.jpg`, "description":` چشمه‌ بابا امان از جاذبه‌هایی‌ است که این گردشگاه را به یکی از مشهورترین جاهای دیدنی استان خراسان شمالی تبدیل می‌کند. علاوه بر این چشمه‌هایی که در مرکز و اطراف گردشگاه بابا امان می‌جوشند، زیبایی طبیعت این پارک را دوچندان کرده‌اند.

          چشمه بابا امان از نوع آب‌های معدنی است و ۳۰۰ تا ۴۰۰ لیتر در ثانیه آبدهی دارد. این چشمه از چهار نقطه درون تپه‌ای می‌جوشد و به درون استخرهایی می‌ریزد که با اختلاف سطح ساخته شده‌اند. آب این چشمه‌ از دسته آب‌های سولفاته کلسیک و سدیک محسوب می‌شود و مصرف آن صفرا آور، ملین و تسهیل‌کننده اعمال گوارشی و دافع سموم است. وجود چنین مزایایی در آب این چشمه در استقبال هرچه بیشتر گردشگران از این مکان بی‌تاثیر نیست. `}
      ],
      "خوزستان": [
          { "id": 13, "title": "رودخانه کارون", "picture": "https://images.kojaro.com/2023/5/eeb4de6d-d032-4996-b142-de69182fc28c.jpg?w=840&h=560", "description": `رود کارون بزرگ‌ترین و طولانی‌ترین رودخانه ایران است که بخش قابل‌توجهی از آن در استان خوزستان قرار دارد. این رود یکی از نخستین سکونتگاه‌های مردم ایران باستان بوده است و به همین دلیل اهمیت بسیاری دارد. در طول سالیان دراز، رود کارون نقش بسزایی در گسترش کشاورزی، دامداری و گردشگری در شهرها و مناطق اطراف خود داشته است.
          رود کارون از شهرهای مختلف استان خوزستان عبور می‌کند و هریک از پل‌های گوناگونی که به زیبایی روی آن ساخته شده، نماد شهرهای مختلف خوزستان است. در حال حاضر، کاهش عمق و حجم آب رودخانه کارون نگرانی بسیاری از علاقه‌مندان به محیط زیست را برانگیخته است. این رودخانه یکی از سرمایه‌های طبیعی ارزشمند ایران است که هرگونه آسیب به آن، تاثیری غیرقابل‌جبران بر اکوسیستم محیط اطراف و زندگی مردم خوزستان خواهد گذاشت. بخش‌های مختلف رود کارون و ساحل‌های آن از زیباترین جاذبه های گردشگری اهواز هستند. در این مقاله به معرفی کامل رود کارون می‌پردازیم. اگر می‌خواهید با این رودخانه بیشتر آشنا شوید، با ما همراه باشید.` }
      ],
      "زنجان": [
          { "id": 14, "title": "بازار زنجان", "picture": "https://images.kojaro.com/2022/6/2d7a37ca-569e-452a-9c24-6dc1f042cfe9.jpg?w=840&h=560", "description": `بازارهای سنتی در گذشته، هسته اصلی تجاری و اقتصادی شهرها را تشکیل می‌دادند و با جنب‌و‌جوش و هیاهویی ویژه، ارزاق موردنیاز مردم را تامین می‌کردند. بسیاری از این بازارهای سنتی امروزه نیز اهمیت خود را حفظ کرده‌اند. بازار زنجان که از جاهای دیدنی زنجان و مهم‌ترین و زیباترین مجموعه‌های تجاری سراسر استان است، در قلب بافت قدیمی و مشرف به «دروازه قلتوق» (دروازه جنوبی شهر زنجان) قرار دارد.` }
      ],
      "سمنان": [
          { "id": 15, "title": "چشمه علی دامغان", "picture": "https://safarmarket.com/blog/data/uploaded_files/c4edbb8770af2e3ddb97a9bb.jpg", "description": `از دیرباز سمنان به عنوان شهر هزار چشمه شهرت داشته‌است. یکی از زیباترین این چشمه‌ها چشمه علی دامغان است که در فاصله ۳۵ کیلومتری دامغان واقع شده است و در ایام قدیم به دلیل چشم‌انداز تماشایی خود، مکان محبوبی برای اتراق پادشاهان در سفرهای بین‌راهی آنها بوده است. از این رو عمارت‌ها و بناهای مختلفی در مجاورت این چشمه بنا شده‌اند که متعلق به سه دوره تاریخی تیموری، صفوی و قاجاری هستند. ناگفته نماند که در زمان‌های قدیم به آن چشمه علی بولاغ می‌گفتند. طبیعت سرسبز باغ‌های حوالی چشمه که در فصل بهار به اوج زیبایی خود می‌رسد در کنار منظره کوه‌های مرتفعی که مانند حصاری در اطراف چشمه و کاخ‌های کناری آن سربلند کرده‌اند، همگی چشم‌انداز شگفت‌انگیزی بوجود آورده‌است و اغلب اهالی دامغان و گردشگران سمنان در تعطیلات برای پیکنیک به این منطقه خوش آب و هوا و خوش منظره می‌آیند و چادرهای خود را در محوطه چشمه برپا می‌کنند و از عمارت‌های این مجموعه نیز دیدن می‌کنند.` }
      ],
      "سیستان و بلوچستان": [
          { "id": 16, "title": "موزه پست و ارتباطات زاهدان", "picture": "https://safarmarket.com/blog/data/uploaded_files/bef9f48da30c75fc704f912f.jpg", "description": `موزه پست و ارتباطات زاهدان یکی از جالب‌ترین مکان‌های دیدنی این شهر محسوب می‌شود. بنای این موزه اولین بار در سال ۱۳۱۱ ساخته شد و به عنوان اولین ایستگاه رادیویی استان به پخش برنامه‌هایی به زبان بلوچی شناخته می‌شود، علاوه بر آن این مکان پستخانه و تلگراف‌خانه شهر نیز محسوب می‌شد. خشت خام و همچنین آجر از مصالح اصلی بکار رفته در بنای ساختمان موزه است و واضح است که باتوجه به شرایط جغرافیایی منطقه سبک معماری کویری برای ساخت آن مورد توجه قرار گرفته‌است.
          این مکان از دهه ۱۳۸۰ به موزه تغییر کاربری داده‌است و مجموعه‌ای از ابزار پستی و ارتباطی در غرفه‌ها و ویترین‌های آن به معرض نمایش بازدیدکنندگان درآمده‌است. در حال حاضر این موزه دارای تندیس‌ها و ماکت‌های مختلف پستچی‌ها، تعدادی از گوشی‌های کلکسیونی و قدیمی، انواع تمبرهای قدیمی و اهدایی کشورهای دیگر، مهرهای قدیمی شهر سوخته و تمبرزن است. گفتنی است نام این موزه در سال ۱۳۷۷ در شمار آثار ملی ایران به ثبت رسیده‌است.` }
      ],
      "فارس": [
          { "id": 17, "title": "مسجد نصیر الملک", "picture": "https://images.kojaro.com/2021/4/2cc90b71-5096-42fd-a0c9-efa156d5c5a8.jpg?w=840&h=560", "description": "مسجد نصیر الملک یکی از زیباترین مساجد شیراز است که قدمت آن به دوره قاجاریه بازمی‌گردد. این مسجد در محله‌ای واقع شده است که پیشتر به خانواده قوام تعلق داشت و تعدادی از آثار تاریخی آن دوران، در آن واقع شده‌اند. امروزه این مسجد دوست‌داشتنی که با نام مسجد صورتی نیز شهرت دارد، یکی از پرطرفدارترین جاهای دیدنی استان فارس در شیراز به شمار می‌رود و محبوبیت زیادی بین گردشگران داخلی و خارجی دارد." }
      ],
      "قزوین": [
          { "id": 18, "title": "قلعه الموت", "picture": "https://images.kojaro.com/2023/5/24a61232-23ce-4531-958c-771343d9a877.jpg?w=840&h=560", "description": "قلعه الموت از جاذبه‌های گردشگری قزوین و یکی از مهم‌ترین قلعه های تاریخی ایران است که محلی ایدئال برای علاقه‌مندان به تاریخ و باستان‌شناسی به حساب می‌آید. این قلعه در قرن پنج هجری قمری مقر حسن صباح، بنیان‌گذار دولت اسماعیلیان و مخالف سلجوقیان بود که به‌دلیل فعالیت‌های نظامی او شهرت زیادی پیدا کرد. قلعه الموت نه‌تنها یک جاذبه تاریخی دیدنی است؛ بلکه طبیعت زیبایی دارد که می‌تواند برای هر گردشگری جذاب باشد. فقط کسانی می‌توانند سحرآمیز بودن این قلعه را درک ‌کنند که از پله‌های‌ الموت بالا بروند و سختی راه را بچشند. در ادامه این مقاله از کجارو با قلعه الموت بیشتر آشنا خواهید شد." }
      ],
      "قم": [
          { "id": 19, "title": "دریاچه حوض سلطان", "picture": "https://images.kojaro.com/2022/9/30b41b2c-3cee-49e3-a605-1382b762d341.jpg?w=840&h=560", "description": "دریاچه‌های نمک یکی از شگفت‌انگیزترین عناصر طبیعت هستند که به‌واسطه تبخیر شدید و رسوبات نمکی فراوان در منابع آبی پدید می‌آیند. کشور ایران به‌واسطه اقلیم خشک و کویری، از تعداد بسیاری از این دریاچه‌ها میزبانی می‌کند که در این میان یکی از جاهای دیدنی قم، دریاچه حوض سلطان است." }
      ],
      "گلستان": [
          { "id": 27, "title": "پارک جنگلی ناهارخوران", "picture": "https://images.kojaro.com/2024/2/91c51232-cc2b-4bda-80a6-4c507d42ffd8.jpg?w=840&h=560", "description": "منطقه جنگلی ناهارخوران یکی از جاذبه‌های دیدنی شهرستان گرگان است که در نزدیکی شهر گرگان قرار دارد. ناهارخوران از جنگل‌ های هیرکانی شمال کشور به شمار می‌رود که قدمت آن به ۴۰ میلیون سال می‌رسد. جنگل ناهارخوران گردشگاهی بی‌نظیر برای لذت بردن از هوای مطبوع و دلپذیر و گشت‌و‌گذار در لابه‌لای درختان بلندقامت آن است. پیاده‌روی، کوهنوردی و صعود به ارتفاعات ناهارخوران از جمله تفریحاتی هستند که در این جنگل می‌توانید تجربه کنید. ‌در کنار آن، امکاناتی نظیر شهربازی، رستوران و کافه نیز در این جنگل باشکوه ایجاد شده است تا سفری خاطره‌انگیز داشته باشید" }
      ],
      "گیلان": [
          { "id": 28, "title": "مجموعه میدان شهرداری رشت", "picture": "https://images.kojaro.com/2024/2/334db5df-b6b1-4cf1-aee4-2438d2fbe488.jpg?w=840&h=560", "description": "میدان شهرداری رشت در اوایل سلطنت رضا پهلوی (۱۳۰۴-۱۳۲۰) احداث شد و مجموعه آن شامل کاخ شهرداری، موزه پست و ساختمان قدیمی هتل ایران می‌شود. ساختمان شهرداری و برج ساعت آن، نماد شهر رشت است. این بنا هنگام وقوع زلزله مهیب و ویرانگر منجیل در سال ۱۳۶۹ آسیب دید و چندی بعد توسط روبرت واهانیان، به‌صورت سابق مرمت شد." }
      ],
      "لرستان": [
          { "id": 29, "title": "آبشار بیشه", "picture": "https://images.kojaro.com/2020/4/d8084d49-af29-471b-a476-d5a835ed8d36.jpg?w=840&h=560", "description": "استان لرستان به داشتن آبشارهای زیبا و تماشایی شهره است و چندین آبشار کوچک و بزرگ را در خود جای داده است. از معروف‌ترین آبشارهای لرستان می‌توان به آبشار «بیشه» اشاره کرد که از جاهای دیدنی خرم آباد به شمار می‌رود و در ۶۶ کیلومتری این شهر و ۸۷ کیلومتری دورود قرار دارد. آبشار بیشه که به‌عنوان چهل‌وهشتمین اثر ملی در فهرست میراث طبیعی ایران به ثبت رسیده است، حدود ۴۸ متر ارتفاع دارد و عرض تاج آن نیز به ۲۰ متر می‌رسد." }
      ],
      "هرمزگان": [
          { "id": 30, "title": "تنگه چاهکوه", "picture": "https://images.kojaro.com/2023/5/1e11fc9a-e4c0-4028-bdb6-538bd1ce9fbe.jpg?w=840&h=560", "description": "جزیره زیبای قشم از بخش‌های توریستی و مهم ایران به شمار می‌رود که سالانه میزبان تعداد زیادی گردشگر از نقاط مختلف ایران و جهان است. این جزیره اولین ژئوپارک خاورمیانه محسوب می‌شود و سفر به آن افراد را با خارق‌العاده‌ترین مناظر روبه‌رو می‌کند. تنگه چاهکوه یک جاذبه طبیعی و منحصربه‌فرد است که از جاهای دیدنی قشم محسوب می‌شود و در قلب جزیره شکل گرفته است. برای آشنایی بیشتر با تنگه چاهکوه در ادامه این مقاله همراه ما باشید." }
      ],
      "همدان": [
          { "id": 31, "title": "غار علیصدر", "picture": "https://images.kojaro.com/2023/11/5f9475e1-32a5-4286-89f5-7d1b4d6d99f2.jpg?w=840&h=560", "description": `غار علیصدر همدان از بزرگ‌ترین غارهای ایران و از معدود غارهای آبی قابل قایق‌رانی در جهان است که طولانی‌ترین مسیر قایق‌رانی را دارد. این غار که قدمت آن به میلیون‌ها سال پیش بازمی‌گردد، در روستای علیصدر همدان قرار دارد و یکی از شگفت‌انگیزترین جاذبه‌ های طبیعی ایران و جهان است. 
          با بازدید از غار علیصدر، سوار بر قایق‌های پدالی در مسیر آب از دل دهلیزهای متعدد و دالان‌های پرپیچ‌وخم عبور می‌کنید و هرچه پیش می‌روید، با شگفتی‌های بیشتری مواجه می‌شوید که شما را حیرت‌زده می‌کند. این غار در مجتمع تفريحی توریستی علیصدر قرار گرفته و با امکاناتی نظیر چندین رستوران، سفره‌خانه سنتی و کافی‌شاپ، مرکز خرید، رصدخانه، نمازخانه، آلاچیق چوبی، سرویس بهداشتی، پارکینگ، هتل و سوئیت‌های اقامتی، پذیرای گردشگران است.` }
      ],
      "کرمان": [
          { "id": 32, "title": "باغ شاهزاده ماهان", "picture": "https://images.kojaro.com/2023/5/f1437c68-f7a2-4082-9a94-c1e68aabeecd.jpg?w=840&h=560", "description": `باغ‌‌گردی و تماشای مناظر دلکش و باصفای باغ یکی از بهترین تفریح‌ها است؛ به‌ویژه اگه قرار باشد برای گردش به باغی تاریخی و دیدنی در دل شهری کویری بروید. شاهزاده ماهان (یا شازده ماهان) یکی از این باغ‌های دل‌انگیز است که در دو کیلومتری شهر ماهان و در نزدیکی کرمان قرار دارد.
          در سفر به شهر کرمان و گردش در باغ شازده ماهان همراه کجارو باشید.` }
      ]
  }

    // try {
    //     // بررسی داده‌های قبلی در Firestore
    //     const querySnapshot = await getDocs(collection(db, "products"));
    //     const existingProductIds = new Set(
    //         querySnapshot.docs.map(doc => doc.data().id)  // شناسه‌های موجود
    //     );

    //     // ارسال یا به‌روزرسانی داده‌ها
    //     for (const [province, places] of Object.entries(products)) {
    //         for (const place of places) {
    //             // اگر ID محصول در Firebase موجود نیست، آن را اضافه می‌کنیم
    //             if (!existingProductIds.has(place.id)) {
    //                 await setDoc(doc(db, "products", place.id.toString()), {
    //                     province,
    //                     ...place
    //                 });
    //                 console.log(`${place.title} به فایر بیس اضافه شد.`);
    //             } else {
    //                 console.log(`${place.title} قبلاً موجود است.`);
    //             }
    //         }
    //     }

    //     console.log("داده‌ها با موفقیت اضافه شدند!");
    // } catch (error) {
    //     console.error("خطا در افزودن داده‌ها:", error);
    // }
};

export default addProducts;
addProducts();
window.addProducts = addProducts;
